**`teams/nomis/windows_server_2019_jumpserver`** terragrunt plan on `pull_request` event [#862](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 2s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 3s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.0/1"
        name                  = "jumpserver_2019"
      + supported_os_versions = []
        tags                  = {
            "amazon-cloudwatch-agent-windows-version" = "1.0.0"
            "application"                             = "NOMIS"
            "branch"                                  = "dsos-1655-resolve-component-issue"
            "business-unit"                           = "HMPPS"
            "ec2launch-v2-windows-version"            = "1.0.0"
            "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
            "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
            "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
            "is-production"                           = "false"
            "jumpserver_2019-version"                 = "1.0.0"
            "os-version"                              = "windows server 2019"
            "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "powershell_core-version"                 = "0.1.5"
            "prometheus_windows_exporter-version"     = "1.1.3"
            "release-or-patch"                        = "test"
            "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["jumpserver_2019.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.0/1"
        name                  = "jumpserver_2019"
      ~ tags                  = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["powershell_core.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: powershell_core
            description: Component to upgrade to using PowerShell Core
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.5
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - PowerShellCoreVersion:
                  type: string
                  default: 7.3.1
                  description: Version of the PowerShell Core to install
            phases:
              - name: build
                steps:
                  - name: InstallPowerShellCore
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          choco install -y chocolatey-core.extension
                          choco install -y kb3118401
                          choco install -y powershell-core --version '{{ PowerShellCoreVersion }}' --install-arguments='"ADD_EXPLORER_CONTEXT_MENU_OPENPOWERSHELL=1 REGISTER_MANIFEST=1 ADD_FILE_CONTEXT_MENU_RUNPOWERSHELL=1 ENABLE_PSREMOTING=1"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to upgrade to using PowerShell Core"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "powershell_core"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "0.1.5"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: prometheus_windows_exporter
            description: Component to install prometheus windows exporter.
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.1.4
                  description: Component version (update this each time the file changes)
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform.
              - WindowsExporterVersion:
                  type: string
                  default: 0.19.0
                  description: Version of the prometheus-windows-exporter
            phases:
              - name: build
                steps:
                  - name: InstallWMIExporter
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - choco install -y prometheus-windows-exporter.install --version '{{ WindowsExporterVersion }}' --params '"/ListenPort:9100"'
        EOT
      + date_created = (known after apply)
      + description  = "Component to install prometheus windows exporter."
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "prometheus_windows_exporter"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all     = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + type         = (known after apply)
      + version      = "1.1.4"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
        name         = "nomis_windows_server_2019_jumpserver"
      ~ tags         = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Windows Server 2019 jumpserver"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-windows-server-2019-jumpserver"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-1"
      + name                             = "nomis_windows_server_2019_jumpserver"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "Windows Server 2019 jumpserver"
      + id               = (known after apply)
      + name             = "nomis_windows_server_2019_jumpserver"
      + owner            = (known after apply)
      + parent_image     = (sensitive)
      + platform         = (known after apply)
      + tags             = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + tags_all         = {
          + "amazon-cloudwatch-agent-windows-version" = "1.0.0"
          + "application"                             = "NOMIS"
          + "branch"                                  = "main"
          + "business-unit"                           = "HMPPS"
          + "ec2launch-v2-windows-version"            = "1.0.0"
          + "image-pipeline"                          = "nomis_windows_server_2019_jumpserver"
          + "image-recipe"                            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "infrastructure-configuration"            = "nomis_windows_server_2019_jumpserver/0.0.1"
          + "is-production"                           = "true"
          + "jumpserver_2019-version"                 = "1.0.0"
          + "os-version"                              = "windows server 2019"
          + "owner"                                   = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "powershell_core-version"                 = "0.1.5"
          + "prometheus_windows_exporter-version"     = "1.1.4"
          + "release-or-patch"                        = "release"
          + "source-code"                             = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-windows/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/ec2launch-v2-windows/x.x.x"
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/jumpserver-2019/1.0.0/1"
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_infrastructure_configuration" "this" {
        id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-windows-server-2019-jumpserver-0-0-1"
        name                          = "nomis_windows_server_2019_jumpserver_0_0_1"
      ~ resource_tags                 = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "branch"                                  = "dsos-1655-resolve-component-issue" -> "main"
          ~ "is-production"                           = "false" -> "true"
          ~ "prometheus_windows_exporter-version"     = "1.1.3" -> "1.1.4"
          ~ "release-or-patch"                        = "test" -> "release"
            # (12 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 0 to destroy.

```
